[
    {
        "bookId": 1,
        "bookName": "To Kill a Mockingbird",
        "author": "Harper Lee",
        "image": "https://i.ibb.co.com/r6d5SS4/pngwing-1.png",
       "review": "A timeless classic that explores themes of racial injustice and moral growth. Set in the American South, it captures the life of a young girl who learns about human complexity through her father, a lawyer. Her father takes on a challenging case defending a black man accused of raping a white woman, testing the town's deeply rooted prejudices. The story emphasizes courage, empathy, and the loss of innocence. Lee’s characters feel real, evoking strong emotional connections. A must-read for understanding justice, morality, and empathy.",
        "totalPages": 281,
        "rating": 4.8,
        "category": "Fiction",
        "tags": ["Classic", "Drama"],
        "publisher": "J.B. Lippincott & Co.",
        "yearOfPublishing": 1960
    },
    {
        "bookId": 2,
        "bookName": "1984",
        "author": "George Orwell",
        "image": "https://i.ibb.co.com/mHcs77d/kindpng-7318921.png",
        "review": "A chilling dystopian novel that examines government control and personal freedom in a totalitarian state. Orwell’s vision of a future where 'Big Brother' watches over every citizen is both haunting and thought-provoking. Through Winston’s struggle for individuality, the novel illustrates the dangers of censorship, propaganda, and mind control. This story remains a powerful warning against oppressive regimes. Its exploration of surveillance and autonomy makes it more relevant than ever. It’s a compelling reminder of the value of freedom and the cost of losing it.",
        "totalPages": 328,
        "rating": 4.7,
        "category": "Dystopian",
        "tags": ["Dystopian", "Political"],
        "publisher": "Secker & Warburg",
        "yearOfPublishing": 1949
    },
    {
        "bookId": 3,
        "bookName": "Pride and Prejudice",
        "author": "Jane Austen",
        "image": "https://i.ibb.co.com/PzwrV3w/kindpng-1064993.png",
        "review": "A witty romance that challenges social class norms and explores personal growth. Elizabeth Bennet, an independent and spirited woman, faces societal expectations while navigating complex family dynamics and romance. Austen’s sharp commentary on marriage, wealth, and social status creates a timeless story that appeals to many. With humor and heart, the novel captures the nuances of love and misunderstandings. Elizabeth’s journey from prejudice to self-discovery is both charming and inspiring. A beloved classic that celebrates individuality, wit, and resilience.",
        "totalPages": 279,
        "rating": 4.6,
        "category": "Romance",
        "tags": ["Romance", "Classic"],
        "publisher": "T. Egerton, Whitehall",
        "yearOfPublishing": 1813
    },
    {
        "bookId": 4,
        "bookName": "The Great Gatsby",
        "author": "F. Scott Fitzgerald",
        "image": "https://i.ibb.co.com/tYcJPPx/04.png",
        "review": "A tragic story of love and ambition set in the glamorous Jazz Age. Nick Carraway, the novel’s narrator, observes Jay Gatsby’s relentless pursuit of wealth and the woman he loves, Daisy. The novel captures the American Dream’s corruption and the emptiness that wealth can bring. Gatsby’s life is both captivating and tragic, reflecting the era’s excess and superficial values. Fitzgerald’s prose is poetic, his characters complex, and his themes profound. This story is both a critique of wealth and an exploration of human longing.",
        "totalPages": 180,
        "rating": 4.5,
        "category": "Fiction",
        "tags": ["Classic", "Tragedy"],
        "publisher": "Charles Scribner's Sons",
        "yearOfPublishing": 1925
    },
    {
        "bookId": 5,
        "bookName": "The Catcher in the Rye",
        "author": "J.D. Salinger",
        "image": "https://i.ibb.co.com/YcM6d0j/kindpng-81724-1.png",
        "review": "A thought-provoking story about teenage rebellion and the search for identity. Following Holden Caulfield’s journey through New York City, the novel delves into themes of innocence, isolation, and the pains of growing up. Holden’s voice is unique, his perspective raw and unfiltered. His struggles with societal expectations resonate deeply with readers. Salinger captures the challenges of adolescence and the desire to hold onto childhood. This story remains a favorite for its candid look at youth, identity, and the fear of losing innocence.",
        "totalPages": 234,
        "rating": 4.4,
        "category": "Fiction",
        "tags": ["Coming of Age", "Classic"],
        "publisher": "Little, Brown and Company",
        "yearOfPublishing": 1951
    },
    {
        "bookId": 6,
        "bookName": "The Hobbit",
        "author": "J.R.R. Tolkien",
        "image": "https://i.ibb.co.com/D9048V5/kindpng-2193744-1.png",
        "review": "An epic fantasy journey filled with adventure, courage, and friendship. Bilbo Baggins, an unlikely hero, sets out on a journey to help dwarves reclaim their kingdom. Along the way, he discovers bravery he never knew he had, facing trolls, goblins, and a dragon. Tolkien’s world-building is rich and enchanting, filled with lore and history. The story emphasizes themes of courage and the importance of home. With whimsical creatures and high-stakes adventure, this tale remains a beloved classic in the fantasy genre.",
        "totalPages": 310,
        "rating": 4.8,
        "category": "Fantasy",
        "tags": ["Fantasy", "Adventure"],
        "publisher": "George Allen & Unwin",
        "yearOfPublishing": 1937
    },
    {
        "bookId": 7,
        "bookName": "Moby-Dick",
        "author": "Herman Melville",
        "image": "https://i.ibb.co.com/510Nyz6/kindpng-5624060-1.png",
        "review": "A complex tale of obsession, fate, and the pursuit of the unachievable. Captain Ahab’s relentless hunt for the white whale, Moby-Dick, becomes a symbol of personal vendetta and unyielding determination. Ishmael, the narrator, offers a rich perspective on the crew’s adventure, blending philosophy with action. This story is both an exciting adventure at sea and a deep exploration of human desires. Melville’s writing is dense and symbolic, creating a story that is open to many interpretations. A captivating and challenging read.",
        "totalPages": 635,
        "rating": 4.1,
        "category": "Adventure",
        "tags": ["Adventure", "Classic"],
        "publisher": "Harper & Brothers",
        "yearOfPublishing": 1851
    },
    {
        "bookId": 8,
        "bookName": "The Alchemist",
        "author": "Paulo Coelho",
        "image": "https://i.ibb.co.com/gy5zwGc/kindpng-2592315-1.png",
        "review": "An inspirational journey of self-discovery and following one’s dreams. Santiago, a young shepherd, travels from Spain to Egypt in search of a hidden treasure. Along his journey, he meets wise individuals who help him understand the meaning of life and personal goals. The novel encourages readers to pursue their personal legends and embrace change. Coelho’s writing is poetic and philosophical, making it an uplifting read for anyone seeking purpose. The Alchemist remains a beloved story of following one's dreams and finding one’s path.",
        "totalPages": 208,
        "rating": 4.5,
        "category": "Philosophical Fiction",
        "tags": ["Inspirational", "Adventure"],
        "publisher": "HarperOne",
        "yearOfPublishing": 1988
    },
    {
        "bookId": 9,
        "bookName": "Brave New World",
        "author": "Aldous Huxley",
        "image": "https://i.ibb.co.com/Rvqb5YD/kindpng-4945926-1.png",
        "review": "A visionary dystopian novel that explores technology, control, and human freedom. Set in a future society, the book delves into the use of science to manipulate human emotions and desires. Huxley presents a world where people are kept content through conditioning and a drug called 'soma.' This raises questions about individuality, freedom, and the consequences of sacrificing personal values. The novel's themes of happiness, freedom, and control resonate with readers, making it a profound reflection on modern society. A cautionary tale for technological advancements.",
        "totalPages": 268,
        "rating": 4.4,
        "category": "Dystopian",
        "tags": ["Dystopian", "Science Fiction"],
        "publisher": "Chatto & Windus",
        "yearOfPublishing": 1932
    }
]
